# Задача 1. Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей. 
#Дано a, b, c - стороны предполагаемого треугольника. Требуется сравнить длину каждого отрезка-стороны с суммой двух других. 
#Если хотя бы в одном случае отрезок окажется больше суммы двух других, то треугольника 
#с такими сторонами не существует. Отдельно сообщить является ли треугольник разносторонним, равнобедренным или равносторонним.

a = int(input("Введите длину первой стороны: "))
b = int(input("Введите длину второй стороны: "))
c = int(input("Введите длину третий стороны: "))

if a > b + c or b > a + c or c > a + b:
    print(f"Треугольника с такими сторонами не существует \nДлины Ваших сторон \n 1 сторона: {a}\n 2 сторона:"
              f" {b}\n 3 сторона: {c}")
elif a != b and a != c and b != c:
    print(f"Треугольник разносторонний \nДлины Ваших сторон \n 1 сторона: {a}\n 2 сторона: {b}\n 3 сторона: {c}")
elif a == b or a == c or b == c:
    print(f"Треугольник равнобедренный \nДлины Ваших сторон \n 1 сторона: {a}\n 2 сторона: {b}\n 3 сторона: {c}")
else:
    print(f"Длины Ваших сторон \n 1 сторона: {a}\n 2 сторона: {b}\n 3 сторона: {c}")

