#Задача 2. Напишите код, который запрашивает число и 
#сообщает является ли оно простым или составным.
#Используйте правило для проверки: “Число является простым, 
#если делится нацело только на единицу и на себя”. 
#Сделайте ограничение на ввод отрицательных чисел и чисел больше 100 тысяч.\

def is_prime(num):
    for i in range(2, (num//2)+1):
        if num % i == 0:
            return False
    return True
num = int(input())
if num < 0 or num > 100000:
    print("Нельзя вводить отрицательное число или число больше 100000")
else:
    if is_prime(num):
        print("Число простое")
    else:
        print("Число составное")